NamJeongkuk/ref_main/src/micro-rx130-cap-touch/QeDiagnostics/r_qetouch_diagnostics.c
#if (QE_CFG_DIAG_PERFORM_CHECKSUM == 1)
typedef struct QE_CHECKSUM_RANGE
{
	uint32_t start;
	uint32_t end;
}st_qe_checksum_range_t;
#endif

#if (QE_CFG_DIAG_PERFORM_CRC == 1)
/* Arrays for holding an address range for CRC calculations */
/* Code and CONST sections that are verified with CRC. DO NOT MODIFY ORDER OF ARRAY */
#if (!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5))
static const st_qe_crc_range_t gs_qe_crc_ranges[] =
{
	/* these are for the ROM CRC Evaluation */
	{
		/* Casting is intentional here */
		(uint32_t)__sectop("P_QE_TOUCH_DRIVER"), (uint32_t)__secend("P_QE_TOUCH_DRIVER")-1
	},

	{
		/* Casting is intentional here */
		(uint32_t)__sectop("C_QE_TOUCH_SAFETY_CONST"), (uint32_t)__secend("C_QE_TOUCH_SAFETY_CONST")-1
	},

	{
		/* Casting is intentional here */
		(uint32_t)__sectop("C_QE_TOUCH_SAFETY_CONST_1"), (uint32_t)__secend("C_QE_TOUCH_SAFETY_CONST_1")-1
	},

	{
		/* Casting is intentional here */
		(uint32_t)__sectop("C_QE_TOUCH_SAFETY_CONST_2"), (uint32_t)__secend("C_QE_TOUCH_SAFETY_CONST_2")-1
	}
};
#else
R_BSP_SECTION_OPERATORS_INIT(P_QE_TOUCH_DRIVER);
R_BSP_SECTION_OPERATORS_INIT(C_QE_TOUCH_SAFETY_CONSTANT);
R_BSP_SECTION_OPERATORS_INIT(C_QE_TOUCH_SAFETY_CONSTANT_1);
R_BSP_SECTION_OPERATORS_INIT(C_QE_TOUCH_SAFETY_CONSTANT_2);
static const st_qe_crc_range_t gs_qe_crc_ranges[] =
{
	/* these are for the ROM CRC Evaluation */
	{
		/* Casting is intentional here */
		(uint32_t)R_BSP_SECTOP(P_QE_TOUCH_DRIVER), (uint32_t)R_BSP_SECEND(P_QE_TOUCH_DRIVER)-1
	},

	{
		/* Casting is intentional here */
		(uint32_t)R_BSP_SECTOP(C_QE_TOUCH_SAFETY_CONSTANT), (uint32_t)R_BSP_SECEND(C_QE_TOUCH_SAFETY_CONSTANT)-1
	},

	{
		/* Casting is intentional here */
		(uint32_t)R_BSP_SECTOP(C_QE_TOUCH_SAFETY_CONSTANT_1), (uint32_t)R_BSP_SECEND(C_QE_TOUCH_SAFETY_CONSTANT_1)-1
	},

	{
		/* Casting is intentional here */
		(uint32_t)R_BSP_SECTOP(C_QE_TOUCH_SAFETY_CONSTANT_2), (uint32_t)R_BSP_SECEND(C_QE_TOUCH_SAFETY_CONSTANT_2)-1
	}
};
#endif /* BSP inclusion end */
#endif /* Conditional compilation end */

#if (QE_CFG_DIAG_PERFORM_CHECKSUM == 1)
/* Arrays for holding an address range for RAM Checksum calculations */
#if (!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5))
static const st_qe_checksum_range_t gs_qe_checksum_ranges[] =
{
	/* these are for the checksum Evaluation */
	{
		/* Casting is intentional here */
		(uint32_t)__sectop("R_QE_TOUCH_SAFETY_RAMINIT"), (uint32_t)__secend("R_QE_TOUCH_SAFETY_RAMINIT")-1
	},

	{
		/* Casting is intentional here */
		(uint32_t)__sectop("R_QE_TOUCH_SAFETY_RAMINIT_2"), (uint32_t)__secend("R_QE_TOUCH_SAFETY_RAMINIT_2")-1
	},

	{
		/* Casting is intentional here */
		(uint32_t)__sectop("B_QE_TOUCH_SAFETY_RAM_2"), (uint32_t)__secend("B_QE_TOUCH_SAFETY_RAM_2")-1
	}
};
#else
R_BSP_SECTION_OPERATORS_INIT(D_QE_TOUCH_SAFETY_RAMINIT);
R_BSP_SECTION_OPERATORS_INIT(D_QE_TOUCH_SAFETY_RAMINIT_2);
R_BSP_SECTION_OPERATORS_INIT(B_QE_TOUCH_SAFETY_RAM_2);
static const st_qe_checksum_range_t gs_qe_checksum_ranges[] =
{
	/* these are for the checksum Evaluation */
	{
		/* Casting is intentional here */
		#if defined(__CCRX__)
		(uint32_t)R_BSP_SECTOP(R_QE_TOUCH_SAFETY_RAMINIT), (uint32_t)R_BSP_SECEND(R_QE_TOUCH_SAFETY_RAMINIT)-1
		#else
		(uint32_t)R_BSP_SECTOP(D_QE_TOUCH_SAFETY_RAMINIT), (uint32_t)R_BSP_SECEND(D_QE_TOUCH_SAFETY_RAMINIT)-1
		#endif
	},

	{
		/* Casting is intentional here */
		#if defined(__CCRX__)
		(uint32_t)R_BSP_SECTOP(R_QE_TOUCH_SAFETY_RAMINIT_2), (uint32_t)R_BSP_SECEND(R_QE_TOUCH_SAFETY_RAMINIT_2)-1
		#else
		(uint32_t)R_BSP_SECTOP(D_QE_TOUCH_SAFETY_RAMINIT_2), (uint32_t)R_BSP_SECEND(D_QE_TOUCH_SAFETY_RAMINIT_2)-1
		#endif
	},

	{
		/* Casting is intentional here */
		(uint32_t)R_BSP_SECTOP(B_QE_TOUCH_SAFETY_RAM_2), (uint32_t)R_BSP_SECEND(B_QE_TOUCH_SAFETY_RAM_2)-1
	}
};
#endif /* BSP inclusion end */
#endif /* Conditional compilation end */

/* Private (static) global variables */
#if (QE_CFG_DIAG_PERFORM_CHECKSUM == 1)
static bool	gs_first_checksum = true;
static uint16_t gs_stored_checksum = 0;
#endif

#if (QE_CFG_DIAG_PERFORM_CRC == 1)
static bool gs_first_crc = true;
static uint16_t	gs_stored_crc = 0x1234;
#endif

/* Private functions */
static e_diagerr_t diag_self_cap_multi_all(void);
static e_diagerr_t diag_self_cap_multi_sngl(uint8_t index);
static e_diagerr_t diag_mutual_cap_full_scan_all(void);
static e_diagerr_t diag_mutual_cap_full_scan_sngl(uint8_t index);
static e_diagerr_t check_ctsu_registers(void);

#if (QE_CFG_DIAG_PERFORM_CHECKSUM == 1)
static e_diagerr_t driver_ram_checksum(void);
#endif

#if (QE_CFG_DIAG_PERFORM_CRC == 1)
static e_diagerr_t check_driver_crc(void);
static void qe_crc_add_range(const uint8_t* pui8_Data, uint32_t ui32_Length);
#endif

/* Globals needed for module error return data */
uint16_t g_diag_return_array[2] = { 0u, 0u };

/******************************************************************************
 * Function Name : R_CTSU_DiagAll
 *
 * Description   : Application function that performs diagnostic scanning
 * 				 against Renesas FMEA matrix. Retrieves the current method
 * 				 operational mode and method. This is needed to understand how
 * 				 to configure the subsequent test and buffers. Then, this
 * 				 function calls scans for all enabled channels in the
 * 				 configuration (method) that is passed and returns the status
 * 				 of this evaluation. Finally CTSU error/status registers are
 * 				 evaluated and status is returned to calling function.
 *
 *				 Internal mode retrieval is performed using CTSU control call and
 *				 provides this data from ctsu_mode_t
 *                  CTSU_MODE_SELF_SINGLE_SCAN   - Self single scan (currently not supported)
 *                  CTSU_MODE_SELF_MULTI_SCAN   - Self multi-scan
 *                  CTSU_MODE_MUTUAL_FULL_SCAN    - Mutual scan
 *                  DIAG_NO_MODE_DEFINED     - invalid parameter returned
 *
 * Arguments :   method - configuration that is to be scanned. This is found
 *               in the QE tuning output files
 *
 * Return Value(s) : e_diagerr_t which will reflect the following error codes:
 *
 *                 DIAG_ALL_CHECK_SUCCESS - All checks successful
 *                 DIAG_CTSU_UNCONFIGURED - CTSU is not configured
 *                 DIAG_CONFIG_SUCCESS - no issues found with operation
 *                 DIAG_SENSOR_CHECK_SUCCESS - sensors evaluated correctly
 *                 DIAG_CTSU_REG_CHECK_SUCCESS - CTSU registers evaluated correctly
 *                 DIAG_CTSU_NO_CONFIG_SENSORS - no sensors enabled in config
 *                 DIAG_MUTUAL_FIRST_MEASUREMENT_FAIL
 *                 DIAG_MUTUAL_SECOND_MEASUREMENT_FAIL
 *                 DIAG_SELF_MEASUREMENT_FAIL
 *                 DIAG_TS_CAP_FAIL
 *                 DIAG_OVERFLOW_FLAG_TRIP_FAIL
 *                 DIAG_CTSU_READ_FAIL - cannot get data from scan
 *                 DIAG_NO_MODE_DEFINED - invalid CTSU mode
 *                 DIAG_STATUS_REG_READ_FAIL - cannot get CTSU reg data
 *                 DIAG_CTSU_SCAN_IN_PROGRESS
 *
 * Usage Note: This MUST be called AFTER the update data routine is called to
 * 			   ensure data concurrency.
 ******************************************************************************/
e_diagerr_t R_CTSU_DiagAll (uint32_t method)
{
    e_diagerr_t diag_err;
    ctsu_mode_t mode;
    qe_err_t qe_err;

    /* get current CTSU operating mode for this method */
    qe_err = R_CTSU_Control(CTSU_CMD_GET_METHOD_MODE, method, &mode);

