NamJeongkuk/ref_main/src/micro-rx130-cap-touch/QeDiagnostics/r_qetouch_diagnostics.c
    /* Is a scan taking place? */
    if ( QE_ERR_BUSY == qe_err )
    {
    	return DIAG_CTSU_SCAN_IN_PROGRESS;
    }

    /* based on mode, execute the diagnostic  required */
    switch (mode)
    {
        case CTSU_MODE_SELF_MULTI_SCAN:
        {
        	diag_err = diag_self_cap_multi_all();
            break;
        }
        case CTSU_MODE_MUTUAL_FULL_SCAN:
        {
        	diag_err = diag_mutual_cap_full_scan_all();
            break;
        }
        case CTSU_MODE_SELF_SINGLE_SCAN:
        {
            /* this mode is not defined at this time */
            return DIAG_CTSU_MODE_NOT_SUPPORTED;
            break;
        }
        default:
        {
            /* if here, then error has occurred */
        	return DIAG_NO_MODE_DEFINED;
        }
    }

    if (DIAG_SENSOR_CHECK_SUCCESS != diag_err)
    {
        return diag_err;
    }

    /* Check the CTSU registers themselves */
    diag_err = check_ctsu_registers();
    if (DIAG_CTSU_REG_CHECK_SUCCESS != diag_err)
    {
        return diag_err;
    }

    /* Perform checksum on critical driver RAM */
#if (QE_CFG_DIAG_PERFORM_CHECKSUM == 1)
    diag_err = driver_ram_checksum();
    if (DIAG_CHECKSUM_ROUTINE_SUCCESS != diag_err)
    {
        return DIAG_CHECKSUM_ROUTINE_FAIL;
    }
#endif

    /* Perform CRC on critical driver code and CONST values */
#if (QE_CFG_DIAG_PERFORM_CRC == 1)
    diag_err = check_driver_crc();
    if (DIAG_CRC_ROUTINE_SUCCESS != diag_err)
    {
        return diag_err;
    }
#endif

    /* if all checks passed to this point, return success */
    return DIAG_ALL_CHECK_SUCCESS;
}
/******************************************************************************
 End of function R_CTSU_DiagAll
 ******************************************************************************/

/******************************************************************************
 * Function Name : R_CTSU_DiagSingle
 *
 * Description   : Application function that performs diagnostic scanning against
 *               Renesas FMEA matrix. This function scans ONLY ONE channel in
 *               the configuration (method) that is passed and returns the
 *               status of this evaluation. Operational mode is determined
 *               of the method that is passed. This is needed to understand how
 * 				 to configure the subsequent test and buffers. Then, this
 * 				 function calls scans for only that enabled channel in the
 * 				 configuration (method) that is passed and returns the status
 * 				 of this evaluation. Finally CTSU error/status registers are
 * 				 evaluated and status is returned to calling function.
 *
 * 				 Internal mode retrieval is performed using CTSU control call and
 *				 provides this data from ctsu_mode_t
 *                  CTSU_MODE_SELF_SINGLE_SCAN   - Self single scan (currently not supported)
 *                  CTSU_MODE_SELF_MULTI_SCAN   - Self multi-scan
 *                  CTSU_MODE_MUTUAL_FULL_SCAN    - Mutual scan
 *                  DIAG_NO_MODE_DEFINED     - invalid parameter returned
 *
 * Arguments     : button_index - index of the single button to be checked
 * 			  	 which is available in the QE tuned output files
 *
 *               method - configuration that is to be scanned. This is found
 *               in the QE tuning output files
 *
 * Return Value(s) : e_diagerr_t which will reflect the following error codes:
 *
 *                 DIAG_ALL_CHECK_SUCCESS - All checks successful
 *                 DIAG_CTSU_UNCONFIGURED - CTSU is not configured
 *                 DIAG_SENSOR_CHECK_SUCCESS - sensors evaluated correctly
 *                 DIAG_CTSU_REG_CHECK_SUCCESS - CTSU registers evaluated correctly
 *                 DIAG_CTSU_NO_CONFIG_SENSORS - no sensors enabled in config
 *                 DIAG_MUTUAL_FIRST_MEASUREMENT_FAIL
 *                 DIAG_MUTUAL_SECOND_MEASUREMENT_FAIL
 *                 DIAG_SELF_MEASUREMENT_FAIL
 *                 DIAG_TS_CAP_FAIL
 *                 DIAG_OVERFLOW_FLAG_TRIP_FAIL
 *                 DIAG_CTSU_READ_FAIL - cannot get data from scan
 *                 DIAG_NO_MODE_DEFINED - invalid CTSU mode
 *                 DIAG_STATUS_REG_READ_FAIL - cannot get CTSU reg data
 *                 DIAG_CTSU_SCAN_IN_PROGRESS
 *
 * Usage Note: This MUST be called AFTER the update data routine is called to
 * 			   ensure data concurrency.
 ******************************************************************************/
e_diagerr_t R_CTSU_DiagSingle (uint32_t method, uint8_t button_index)
{
    e_diagerr_t diag_err;
    ctsu_mode_t mode;
    qe_err_t qe_err;

    /* get current CTSU operating mode for this method */
    qe_err = R_CTSU_Control(CTSU_CMD_GET_METHOD_MODE, method, &mode);

    /* Is a scan taking place? */
    if ( QE_ERR_BUSY == qe_err )
    {
    	return DIAG_CTSU_SCAN_IN_PROGRESS;
    }

    /* based on mode, execute the diagnostic  required */
    switch (mode)
    {
        case CTSU_MODE_SELF_MULTI_SCAN:
        {
        	diag_err = diag_self_cap_multi_sngl(button_index);
            break;
        }
        case CTSU_MODE_MUTUAL_FULL_SCAN:
        {
        	diag_err = diag_mutual_cap_full_scan_sngl(button_index);
            break;
        }
        case CTSU_MODE_SELF_SINGLE_SCAN:
        {
            /* currently this mode is not implemented, so return failure */
            return DIAG_CTSU_MODE_NOT_SUPPORTED;
            break;
        }
        default:
        {
            return DIAG_NO_MODE_DEFINED;
        }
    }

    if (DIAG_SENSOR_CHECK_SUCCESS != diag_err)
    {
        return diag_err;
    }

    /* Check the CTSU registers themselves */
    diag_err = check_ctsu_registers();
    if (DIAG_CTSU_REG_CHECK_SUCCESS != diag_err)
    {
        return diag_err;
    }

    /* Perform checksum on critical driver RAM */
#if (QE_CFG_DIAG_PERFORM_CHECKSUM == 1)
    diag_err = driver_ram_checksum();
    if (DIAG_CHECKSUM_ROUTINE_SUCCESS != diag_err)
    {
        return DIAG_CHECKSUM_ROUTINE_FAIL;
    }
#endif

    /* Perform CRC on critical driver code and CONST values */
#if (QE_CFG_DIAG_PERFORM_CRC == 1)
    diag_err = check_driver_crc();
    if (DIAG_CRC_ROUTINE_SUCCESS != diag_err)
    {
        return diag_err;
    }
#endif

