NamJeongkuk/ref_main/src/micro-rx130-cap-touch/QeDiagnostics/r_qetouch_diagnostics.c
    return DIAG_ALL_CHECK_SUCCESS;
}
/******************************************************************************
 End of function R_CTSU_DiagSingle
 ******************************************************************************/


/******************************************************************************
 * Function Name: diag_self_cap_multi_all
 *
 * Description : Performs scan on CTSU values returned from driver and validates
 *               them based on define constants from .h file. Only the sensor
 *               counter is used for validating against the FMEA matrix.
 *
 *               Instances local buffer for data storage as follows:
 *               In self mode, there is a MAX of 36 channels, so array is
 *               defined by QETOUCH_IF_DIAGSELF_BUFFSIZE
 *
 * Arguments :   method - configuration that is to be scanned. This is found
 *               in the QE tuning output files
 *
 * Return Value(s) : e_diagerr_t which will reflect the following error codes:
 *
 *                 DIAG_SENSOR_CHECK_SUCCESS - sensors evaluated correctly
 *                 DIAG_CTSU_NO_CONFIG_SENSORS - no sensors enabled in config
 *                 DIAG_SELF_MEASUREMENT_FAIL
 *                 DIAG_CTSU_READ_FAIL - cannot get data from scan
 *
 * Usage Note: internal API function not intended to be called from application
  ******************************************************************************/
static e_diagerr_t diag_self_cap_multi_all (void)
{
    qe_err_t err;
    uint16_t buf[QETOUCH_IF_DIAGSELF_BUFFSIZE] =
    { 0 };
    uint16_t cnt;

    /** get data from the last scan for all elements. if anything other than
     * success is returned from this call, then fail the diag check */
    err = R_CTSU_ReadData(buf, &cnt);
    if (QE_SUCCESS != err)
    {
        return DIAG_CTSU_READ_FAIL;
    }

    /* put a fail-safe check here if there are no enabled channels, then return error */
    if (0 == cnt)
    {
        return DIAG_CTSU_NO_CONFIG_SENSORS;
    }

    /* ensure error return array is reset each time thru */
    g_diag_return_array[0] = 0;
    g_diag_return_array[1] = 0;

    /* setup loop variables */
    uint8_t i;
    uint8_t j = 0;
    for (i = 0; i < cnt; i++)
    {
        /* first check Sensor Counter */
        /* covers HW Self Capacitance line items: 1.1.0, 1.1.1, 1.1.2, 1.1.3, 1.1.4 */
        if (buf[j] >= SELFCAP_CFG_UPPERLIMIT)
        {
            /* if error, load array elements */
            g_diag_return_array[0] = buf[j];
            g_diag_return_array[1] = i;
            return DIAG_SELF_MEASUREMENT_FAIL;
        }

        /* covers HW Self Capacitance line items: 1.1.5, 1.1.6 */
        if (buf[j] <= SELFCAP_CFG_LOWERLIMIT)
        {
            /* if error, load array elements */
            g_diag_return_array[0] = buf[j];
            g_diag_return_array[1] = i;
            return DIAG_SELF_MEASUREMENT_FAIL;
        }

        /* increment to next position for Reference Sensor count */
        j++;
    }

    return DIAG_SENSOR_CHECK_SUCCESS;
}
/******************************************************************************
 End of function diag_self_cap_multi_all
 ******************************************************************************/

/******************************************************************************
 * Function Name: diag_self_cap_multi_sngl
 *
 * Description : Performs scan on a single sensor (button) against the FMEA
 *               matrix. If errors are encountered, then return those up so
 *               they can be passed to application for action. This is for
 *               SELF mode only.
 *
 * Arguments :  index - value of the sensor to evaluate that is passed from
 *              the application. This is found in the QE tuning output parameter
 *              files.
 *
 * Return Value(s) : e_diagerr_t which will reflect the following error codes:
 *
 *                 DIAG_SENSOR_CHECK_SUCCESS - sensors evaluated correctly
 *                 DIAG_CTSU_REG_CHECK_SUCCESS - CTSU registers evaluated correctly
 *                 DIAG_CTSU_NO_CONFIG_SENSORS - no sensors enabled in config
 *                 DIAG_SELF_MEASUREMENT_FAIL
 *                 DIAG_CTSU_READ_FAIL - cannot get data from scan
 *
 * Usage Note: internal API function not intended to be called from application
  ******************************************************************************/
static e_diagerr_t diag_self_cap_multi_sngl (uint8_t index)
{
    qe_err_t err;
    uint16_t sensor_val;

    /* retrieve sensor data from previous scan */
    err = R_CTSU_ReadElement(index, &sensor_val, NULL);

    /* put a fail-safe check here CTSU cannot read, then return error */
    if (QE_SUCCESS != err)
    {
        return DIAG_CTSU_READ_FAIL;
    }

    /* ensure error return array is reset each time thru */
    g_diag_return_array[0] = 0;
    g_diag_return_array[1] = 0;

    /* first check Sensor Counter */
    /* covers HW Self Capacitance line items: 1.1.0, 1.1.1, 1.1.2, 1.1.3, 1.1.4 */
    if (sensor_val >= SELFCAP_CFG_UPPERLIMIT)
    {
        /* cast here intentionally */
        g_diag_return_array[0] = sensor_val;
        g_diag_return_array[1] = index;
        return DIAG_SELF_MEASUREMENT_FAIL;
    }

    /* covers HW Self Capacitance line items: 1.1.5, 1.1.6 */
    if (sensor_val <= SELFCAP_CFG_LOWERLIMIT)
    {
        /* cast here intentionally */
        g_diag_return_array[0] = sensor_val;
        g_diag_return_array[1] = index;
        return DIAG_SELF_MEASUREMENT_FAIL;
    }

    return DIAG_SENSOR_CHECK_SUCCESS;
}
/******************************************************************************
 End of function diag_self_cap_multi_sngl
 ******************************************************************************/

/******************************************************************************
 * Function Name: diag_mutual_cap_full_scan_all
 *
 * Description : Performs scan on all sensors (button) against the FMEA
 *               matrix. If errors are encountered, then return those up so
 *               they can be passed to application for action.
 *
 *               Instances local buffer for data storage as follows:
 *               For mutual, the max local data structure size is: 36 ch x 2
 *               bits or 72 16-bit words for primary and secondary sensor
 *               counter values
 *
 * Arguments :  method - value of the sensor to evaluate that is passed from
 *              the application. This is found in the QE tuning output parameter
 *              files.
 *
 * Return Value(s) : e_diagerr_t which will reflect the following error codes:
 *
 *                 DIAG_SENSOR_CHECK_SUCCESS - sensors evaluated correctly
 *                 DIAG_CTSU_NO_CONFIG_SENSORS - no sensors enabled in config
 *                 DIAG_MUTUAL_FIRST_MEASUREMENT_FAIL
 *                 DIAG_MUTUAL_SECOND_MEASUREMENT_FAIL
 *                 DIAG_CTSU_READ_FAIL - cannot get data from scan
 *
 * Usage Note: internal API function not intended to be called from application
  ******************************************************************************/
static e_diagerr_t diag_mutual_cap_full_scan_all (void)
{
    qe_err_t err;
    uint16_t buf[QETOUCH_IF_DIAGMUTUAL_BUFFSIZE] =
    { 0 };
    uint16_t cnt;

