NamJeongkuk/ref_main/src/micro-rx130-cap-touch/QeDiagnostics/r_qetouch_diagnostics.c
    /** get data from the last scan for all elements. if anything other than
     * success is returned from this call, then fail the diag check */
    err = R_CTSU_ReadData(buf, &cnt);
    if (QE_SUCCESS != err)
    {
        return DIAG_CTSU_READ_FAIL;
    }

    /* put a fail-safe check here if there are no enabled channels, then return error */
    if (0 == cnt)
    {
        return DIAG_CTSU_NO_CONFIG_SENSORS;
    }

    /* ensure error return array is reset each time thru */
    g_diag_return_array[0] = 0;
    g_diag_return_array[1] = 0;

    /* setup loop variables */
    uint8_t k = 0;
    uint16_t l = 0;
    for (l = 0; l < cnt;)
    {
        /* First Sensor Counter Measurement */
        /* FMEA 2.1.1, 2.1.2, 2.1.3, 2.1.4, 2.1.5, 2.1.6, 2.1.7, 2.1.8
         *      2.2.1, 2.2.2
         *      2.3.1, 2.3.2, 2.3.3, 2.3.4
         *      2.4.1, 2.4.2, 2.4.3, 2.4.4, 2.4.5, 2.4.6, 2.4.7, 2.4.8  */
        if ((buf[l] >= MUTUAL_CFG_FIRSTUPPERLIMIT) || (buf[l] <= MUTUAL_CFG_FIRSTLOWERLIMIT))
        {
            /* cast here intentionally */
            g_diag_return_array[0] = (uint16_t) buf[l];
            g_diag_return_array[1] = k;
            return DIAG_MUTUAL_FIRST_MEASUREMENT_FAIL;
        }

        /* Second Sensor Counter Measurement */
        /* FMEA 2.1.1, 2.1.2, 2.1.3, 2.1.4, 2.1.5, 2.1.6, 2.1.7, 2.1.8
         *      2.2.1, 2.2.2
         *      2.3.1, 2.3.2, 2.3.3, 2.3.4
         *      2.4.1, 2.4.2, 2.4.3, 2.4.4, 2.4.5, 2.4.6, 2.4.7, 2.4.8  */
        l++;
        if ((buf[l] >= MUTUAL_CFG_SECONDUPPERLIMIT) || (buf[l] <= MUTUAL_CFG_SECONDLOWERLIMIT))
        {
            /* cast here intentionally */
            g_diag_return_array[0] = (uint16_t) buf[l];
            g_diag_return_array[1] = k;
            return DIAG_MUTUAL_SECOND_MEASUREMENT_FAIL;
        }
        k++;
		l++;
    }

    return DIAG_SENSOR_CHECK_SUCCESS;
}
/******************************************************************************
 End of function diag_mutual_cap_full_scan_all
 ******************************************************************************/

/******************************************************************************
 * Function Name: diag_mutual_cap_full_scan_sngl
 *
 * Description : Performs scan on a single sensor (button) against the FMEA
 *               matrix. If errors are encountered, then return those up so
 *               they can be passed to application for action. This is for
 *               MUTUAL mode only.
 *
 * Arguments :  index - value of the sensor to evaluate that is passed from
 *              the application. This is found in the QE tuning output parameter
 *              files.
 *
 * Return Value(s) : e_diagerr_t which will reflect the following error codes:
 *
 *                 DIAG_SENSOR_CHECK_SUCCESS - sensors evaluated correctly
 *                 DIAG_CTSU_REG_CHECK_SUCCESS - CTSU registers evaluated correctly
 *                 DIAG_MUTUAL_FIRST_MEASUREMENT_FAIL
 *                 DIAG_MUTUAL_SECOND_MEASUREMENT_FAIL
 *                 DIAG_CTSU_READ_FAIL - cannot get data from scan
 *
 * Usage Note: internal API function not intended to be called from application
  ******************************************************************************/
static e_diagerr_t diag_mutual_cap_full_scan_sngl (uint8_t index)
{
    qe_err_t err;
    uint16_t primary;
    uint16_t secondary;

    /* retrieve sensor data from previous scan */
    err = R_CTSU_ReadElement(index, &primary, &secondary);

    /* put a fail-safe check here CTSU cannot read, then return error */
    if (QE_SUCCESS != err)
    {
        return DIAG_CTSU_READ_FAIL;
    }

    /* ensure error return array is reset each time thru */
    g_diag_return_array[0] = 0;
    g_diag_return_array[1] = 0;

    /* First Sensor Counter Measurement */
    /* FMEA 2.1.1, 2.1.2, 2.1.3, 2.1.4, 2.1.5, 2.1.6, 2.1.7, 2.1.8
     *      2.2.1, 2.2.2
     *      2.3.1, 2.3.2, 2.3.3, 2.3.4
     *      2.4.1, 2.4.2, 2.4.3, 2.4.4, 2.4.5, 2.4.6, 2.4.7, 2.4.8  */
    if ((primary >= MUTUAL_CFG_FIRSTUPPERLIMIT) || (primary <= MUTUAL_CFG_FIRSTLOWERLIMIT))
    {
        /* cast here intentionally */
        g_diag_return_array[0] = primary;
        g_diag_return_array[1] = index;
        return DIAG_MUTUAL_FIRST_MEASUREMENT_FAIL;
    }

    /* Second Sensor Counter Measurement */
    /* FMEA 2.1.1, 2.1.2, 2.1.3, 2.1.4, 2.1.5, 2.1.6, 2.1.7, 2.1.8
     *      2.2.1, 2.2.2
     *      2.3.1, 2.3.2, 2.3.3, 2.3.4
     *      2.4.1, 2.4.2, 2.4.3, 2.4.4, 2.4.5, 2.4.6, 2.4.7, 2.4.8  */
    if ((secondary >= MUTUAL_CFG_SECONDUPPERLIMIT) || (secondary <= MUTUAL_CFG_SECONDLOWERLIMIT))
    {
        /* cast here intentionally */
        g_diag_return_array[0] = secondary;
        g_diag_return_array[1] = index;
        return DIAG_MUTUAL_SECOND_MEASUREMENT_FAIL;
    }

    return DIAG_SENSOR_CHECK_SUCCESS;
}
/******************************************************************************
 End of function diag_mutual_cap_full_scan_sngl
 ******************************************************************************/

/******************************************************************************
 * Function Name: check_ctsu_registers
 *
 * Description :     Now, to verify if the CTSU is working properly, need to
 *                   verify if the overflow flags happen to be set or cleared
 *                   even if the individual channel testing passed in this case.
 *
 * Arguments :       None
 *
 * Return Value(s) : e_diagerr_t which will reflect the following error codes:
 *
 *                 DIAG_CTSU_REG_CHECK_SUCCESS - CTSU registers evaluated correctly
 *                 DIAG_TS_CAP_FAIL
 *                 DIAG_OVERFLOW_FLAG_TRIP_FAIL
 *                 DIAG_CTSU_READ_FAIL - cannot get data from scan
 *                 DIAG_STATUS_REG_READ_FAIL - cannot get CTSU reg data
 *
 * Usage Note: internal API function not intended to be called from application
 ******************************************************************************/
static e_diagerr_t check_ctsu_registers (void)
{
    qe_err_t err;
    scan_info_t scan_info;
    uint8_t method;

    /* First we need to retrieve the last run method, then the status registers saved from that method */
    R_TOUCH_Control(TOUCH_CMD_GET_LAST_SCAN_METHOD, &method);
    err = R_CTSU_Control(CTSU_CMD_GET_SCAN_INFO, method, &scan_info);
    if (QE_SUCCESS != err)
    {
        return DIAG_STATUS_REG_READ_FAIL;
    }

