NamJeongkuk/ref_main/src/micro-rx130-cap-touch/QeDiagnostics/r_qetouch_diagnostics.c
    /* now check to see if the overflow flag for sensor counter */
    /* has been set but not caught by the raw data check */
    /* FMEA SELF Line Items:    1.1.1, 1.1.2, 1.1.3, 1.1.4, 2.2.1, 2.2.2
     * FEMA MUTUAL Line Items:  2.2.1, 2.2.2
     *                          2.4.1, 2.4.6,  */
    if (( (scan_info.ctsust & 0x60) == 0x20) )
    {
        return DIAG_OVERFLOW_FLAG_TRIP_FAIL;
    }

    /* now check to see if the overflow flag for reference counter */
    /* has been set but not caught by the raw data check */
    /* FMEA SELF Line Items:    1.1.1, 1.1.2, 1.1.3, 1.1.4, 2.2.1, 2.2.2
     * FEMA MUTUAL Line Items:  2.2.1, 2.2.2
     *                          2.4.1, 2.4.6,  */
    if (( (scan_info.ctsust & 0x60) == 0x40) )
    {
        return DIAG_OVERFLOW_FLAG_TRIP_FAIL;
    }

    /* now check to see if the TSCAP error register has been set. if so, then this is an error that */
    /* was not caught by the API or thru the check of the raw counts */
    /* FMEA SELF Line Items: 1.1.5, 1.1.6, 2.2.1, 2.2.2
     * FEMA MUTUAL Line Items:  2.2.1, 2.2.2
     *                          2.4.3, 2.4.4, 2.4.5, 2.4.6  */
    if ((scan_info.ctsuerrs & 0x8000) == 0x8000)
    {
        return DIAG_TS_CAP_FAIL;
    }

    /* Evaluate Module Stop bit has been set inadvertently. Bit consistent for ALL 100 and 200 series MCU families. */
    /* Cast here is intentional */
    if ( (1u) == MSTP(CTSU) )
    {
    	return DIAG_CTSU_MODULE_STOP_FAIL;
    }

    /* casting below is intentional due to SFR access. Check if interrupt is disabled */
    if ( ((0u) == IEN(CTSU,CTSUWR)) || ((0u) == IEN(CTSU,CTSURD)) || ((0u) == IEN(CTSU,CTSUFN)) )
    {
    	return DIAG_CTSU_IEN_ZERO_FAIL;
    }

    /* casting below is intentional due to SFR access. Check if priority is 0 */
    if ( ((0u) == IPR(CTSU,CTSUWR)) || ((0u) == IPR(CTSU,CTSURD)) || ((0u) == IPR(CTSU,CTSUFN)) )
    {
    	return DIAG_CTSU_IPR_ZERO_FAIL;
    }

    return DIAG_CTSU_REG_CHECK_SUCCESS;
}
/******************************************************************************
 End of function check_ctsu_registers
 ******************************************************************************/

#if (QE_CFG_DIAG_PERFORM_CHECKSUM == 1)
/******************************************************************************
 * Function Name: driver_ram_checksum
 *
 * Description :    Routine performs additive checksum with inverse on identified
 * 					critical RAM data used by the CTSU and touch layers. Data
 * 					checksum is created on first pass, then stored. Subsequent
 * 					calls to this routine perform the same calculation, then
 * 					result is compared to stored and results are passed back
 * 					to calling function.
 *
 * 					Checksum stored in: static uint16_t stored_checksum
 *
 *					Arguments :       None
 *
 * Return Value(s) : e_diagerr_t which will reflect the following error codes:
 *
 *                 	DIAG_CHECKSUM_ROUTINE_SUCCESS
 *                 	DIAG_CHECKSUM_ROUTINE_FAIL
 *
 * Usage Note: internal API function not intended to be called from application
 ******************************************************************************/
static e_diagerr_t driver_ram_checksum (void)
{
	uint8_t index;
	uint8_t number_bytes;
	uint8_t * p_address;
	uint16_t checksum;

	/* initialize local calculation result to 0 */
	checksum = 0;

	/* iterative loop used to calculate checksum value */
	for(index = 0; index < QE_PRV_CHECKSUM_RANGE_NUM; index++)
	{
		/* reset address pointer to first address of section for evaluation */
		p_address = (uint8_t*)gs_qe_checksum_ranges[index].start;

		/* set number of bytes in section for summation */
		number_bytes = 1 + ((uint32_t)gs_qe_checksum_ranges[index].end - (uint32_t)gs_qe_checksum_ranges[index].start);

	    while ( (number_bytes--) > 0)
	    {
	    	checksum += (*(p_address++));
	    }
	}

	/* finally invert checksum to capture single bit errors */
	checksum =~ checksum;

	/* on startup, compiler cannot create a checksum by default, so first call will initialize checksum after Open()
	 * completes. Fist call, routine always exits with success
	 */
	if ( true == gs_first_checksum )
	{
		/* reset initial checksum flag */
		gs_first_checksum = false;

		/* store this first calculated checksum */
		gs_stored_checksum = checksum;
		return DIAG_CHECKSUM_ROUTINE_SUCCESS;
	}

	if ( gs_stored_checksum != checksum )
	{
		return DIAG_CHECKSUM_ROUTINE_FAIL;
	}

	return DIAG_CHECKSUM_ROUTINE_SUCCESS;
}
/******************************************************************************
 End of function driver_ram_checksum
 ******************************************************************************/
#endif /* Conditional compilation end */

#if (QE_CFG_DIAG_PERFORM_CRC == 1)
/******************************************************************************
 * Function Name: check_driver_crc
 *
 * Description :    Routine performs CRC calculation using MCU-based CRC block, then
 * 					compares this value against the compiler generated CRC value
 * 					inserted at build time. This validates all CTSU and Touch
 * 					Application code. CRC routine that is utilized is taken from the
 * 					VDE IEC 60730 safety library routines that are referenced by
 * 					R01AN2061ED0100 (RX100 series) and R01AN3364EG0100 (RX200
 * 					series).
 *
 * 					For proper operation and compilation, the CRC modules from
 * 					the above Renesas application notes MUST be a part of the end
 * 					included application.
 *
 *					Arguments :       None
 *
 * Return Value(s) : e_diagerr_t which will reflect the following error codes:
 *
 *                 	DIAG_CRC_ROUTINE_FAIL
 *                 	DIAG_CRC_ROUTINE_SUCCESS
 *
 * Usage Note: internal API function not intended to be called from application
 ******************************************************************************/
static e_diagerr_t check_driver_crc (void)
{
	uint8_t index;
	uint16_t crc_value;

	/* enable the CRC hardware block */
	/*Disable register protection (PRC1)*/
	SYSTEM.PRCR.WORD = 0xA502;

	/*Enable CRC module*/
	SYSTEM.MSTPCRB.BIT.MSTPB23 = 0;

	/*Re-Enable register protection*/
	SYSTEM.PRCR.WORD = 0xA500;

	/*Configure CRC Control Register:
	1.Set Polynomial to CRC-CCITT XModem (h'1021)
		(p(x) = x ** 16 + x ** 12 + x ** 5 + 1)
	2.Set MSB First. (This makes result agree with online CRC calculators.)
	3.Clear CRCDOR register*/
	CRC.CRCCR.BYTE = 0x87;

	/* Initialize the CRC hardware block to 0xFFFF. Clear any previous result.*/
	CRC.CRCCR.BIT.DORCLR = 1;

	/*Initial value */
	CRC.CRCDOR = 0xFFFF;

	/*Specify address ranges for CRC calculation*/
	for(index = 0; index < QE_PRV_CRC_RANGE_NUM; index++)
	{
		/* Casting is intentional here */
		qe_crc_add_range((uint8_t*)gs_qe_crc_ranges[index].start, 1 + ((uint32_t)gs_qe_crc_ranges[index].end - (uint32_t)gs_qe_crc_ranges[index].start));
	}

	/*Return the CRC result. This is as read from CRC Data Output register and bit inverted*/
	crc_value = (uint16_t)~CRC.CRCDOR;


