NamJeongkuk/ref_main/src/micro-rx130-cap-touch/QeDiagnostics/r_qetouch_diagnostics.c
	/* Verify this value is the same as the reference CRC value stored in ROM. First time routine executes, a CRC is generated
	 * and stored. This makes the first pass always successful. Any subsequent failures against the CRC calculation and stored
	 * result are failures and flagged as such
	 */
	if ( true == gs_first_crc )
	{
		gs_first_crc = false;
		gs_stored_crc = crc_value;
	}

	if( gs_stored_crc == crc_value )
	{
		/*Test Passed*/
		return DIAG_CRC_ROUTINE_SUCCESS;
	}
	else
	{
		/*Test Failed*/
		return DIAG_CRC_ROUTINE_FAIL;
	}
}
/******************************************************************************
 End of function check_driver_crc
 ******************************************************************************/

/***********************************************************************************
Function Name : qe_crc_add_range
Description   : Use this function rather than CRC_Calculate if wanting
				to calculate the CRC on data made up of more than one address range.
				Call CRC_Start first then CRC_AddRange for each address range
				required and then call CRC_Result to get the CRC value.

Parameters    : pui8_Data: Start address of dta
			    ui32_Length : Number of bytes of data.
Return value  :
***********************************************************************************/
static void qe_crc_add_range(const uint8_t* pui8_Data, uint32_t ui32_Length)
{
	/*Write the data a byte at a time to the CRC Data Input register.*/
	while(0 != ui32_Length)
	{
		/* Casting performed here intentionally */
		CRC.CRCDIR = *pui8_Data;

		/*Onto the next byte*/
		pui8_Data++;
		ui32_Length--;
	}
}
/******************************************************************************
 End of function qe_crc_add_range
 ******************************************************************************/
#endif /* Conditional compilation end */

/***********************************************************************************************************************
 * Function Name: R_CTSU_DiagGetVersion
 * Description  : Returns the current version of this module. The version number is encoded where the top 2 bytes are the
 *                major version number and the bottom 2 bytes are the minor version number. For example, Version 4.25
 *                would be returned as 0x00040019.
 * Arguments    : none
 * Return Value : Version of this module.
 ***********************************************************************************************************************/
uint32_t R_CTSU_DiagGetVersion(void) {

	/* Casting is intentional here. These version macros are defined in r_qetouch_diagnostics_if.h. */
	return ((((uint32_t) QETOUCH_DIAGNOSTICS_VERSION_MAJOR) << 16) | (uint32_t) QETOUCH_DIAGNOSTICS_VERSION_MINOR);
}
/******************************************************************************
 End of function R_CTSU_DiagGetVersion
 ******************************************************************************/


